tap "homebrew/bundle"
tap "warrensbox/tap"
# Official Amazon AWS command-line interface
brew "awscli"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Kubernetes YAML manifests to Terraform HCL converter
brew "tfk8s"
# Linter for Terraform files
brew "tflint"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Yet Another Dotfiles Manager
brew "yadm"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# The tfswitch command lets you switch between terraform versions.
brew "warrensbox/tap/tfswitch"
# The tgswitch command lets you switch between terragrunt versions.
brew "warrensbox/tap/tgswitch"
# E-books management software
cask "calibre"
# Trains AIs to understand and translate texts
cask "deepl"
# Web browser
cask "firefox"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# GPU-based terminal emulator
cask "kitty"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Team communication and collaboration software
cask "slack"
# Open-source media center
cask "stremio"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
vscode "golang.go"
vscode "hashicorp.terraform"
